# 字符串的格式化
# 使用%作为占位符
name="李石"
age=23
print("我是：%s,今年:%d" %(name,age))
# 使用{}作为占位符
print("我是{0},今年:{1}".format(name,age))
print(f'我是{name},今年:{age}')
# 字符串的精度和宽度
print('%20d' %100)    # 宽度
print('%.3f' %1.238530919)    # 精度
print('%10.3f' %1.238530919)    # 宽度和精度
print('{0}'.format(1.238530919),'{}'.format(1.238530919))
print('{0:.3}'.format(1.238530919),'{:.3}'.format(1.238530919))    # 精确保留3位数字
print('{0:10.3}'.format(1.238530919),'{:10.3}'.format(1.238530919))    # 精确保留3位数字,同时设置宽度
print('{0:.3f}'.format(1.238530919),'{0:.3f}'.format(1.238530919))    # 精确保留3位小数
print('{:10.3f}'.format(1.238530919),'{:10.3f}'.format(1.238530919))    # 精确保留3位小数,同时设置宽度


