# 字符串的切片
str1="hello world"
str2=str1[:5]      # 索引从左往右数，从开头0到索引5之前的字符串截取
str3=str1[6:]      # 索引左往右数，从索引6开始，一直到字符串末尾截取
str4=str1[:-3]     # 索引从右往左数，从索引3向前的所有字符串截取
str5=str1[-3:]     # 索引从右往左数，从索引3向后的所有字符串截取
str6=str1[1:8]     # 索引从左往右数，从索引1到索引8之间的字符串
str7=str1[-8:-1]   # 索引从右往左数，从索引1到索引8之间的字符串
str8=str1[1:-1]    # 索引从左往右数为1的索引开始，到从右往左数的索引为1之间的字符串
str9=str1[-9:9]    # 索引从右往左数索引为9开始，从索引从左往右数的索引为9结束，截取的字符串
str10=str1[1:9:2]  # 索引从左往右数，从开头1到索引为9之前的字符串截取,间隔为2
str11=str1[-1:-9:-2]    # 索引从右往左数，从索引为1到索引为9之间的字符串截取，从右往左排列展示,间隔为2
str12=str1[-1:5:-1]     # 索引从右往左数索引为1到从左往右数索引为5之间的字符串截取，从右往左排列展示,间隔为2
str13=str1[6::1]        # 索引从左往右数索引为5之后的字符串截取，从右往左排列展示,间隔为1
print("str1切片字符串为:",str1,"str2切片字符串为:",str2,"str3切片字符串为:",str3,"str4切片字符串为:",str4,"str5切片字符串为:",str5,"str6切片字符串为:",str6,"str7切片字符串为:",str7)
print("str8切片字符串为:",str8,"str9切片字符串为:",str9,"str10切片字符串为:",str10,"str11切片字符串为:",str11,"str12切片字符串为:",str12,"str13切片字符串为:",str13)


